
#include <iostream>
#include <cstring>
using namespace std;

int main(int argc, char const *argv[])
{ /**
   * Задание 7.1.
   *
   * Объявите двухмерный встроенный массив элементов типа char.
   *
   * Сформируйте значения элементов массива с помощью генератора случайных
   * чисел таким образом, чтобы в массиве были только символы '*' и '_'.
   *
   * В каждой строке "сдвиньте звездочки" в начало строки, например:
   * было - '*' '_' '_' '*' '*' '_' '*' '_' '*' '_'
   * стало: '*' '*' '*' '*' '*' '_' '_' '_' '_' '_'
   * и распечатайте массив по строкам.
   *
   * При этом оцените количество операций, которое требуется для обработки
   * одной строки относительно длины этой строки.
   *
   * Постарайтесь решить эту задачу так, чтобы требовалось не более k*N
   * операций, где N - длина строки, k - некое фиксированное число.
   */

}
